//
//  Models.swift
//  TME
//
//  Created by Eng. Norii on 5/18/20.
//  Copyright © 2020 EngSrayea. All rights reserved.
//

import Foundation


var athkar = [
    "الحمدلله رب العالمين",
    "وَلَا يَحْزُنْكَ قَوْلُهُمْ إِنَّ الْعِزَّةَ لِلَّهِ جَمِيعًا هُوَ السَّمِيعُ الْعَلِيمُ (65) يونس",
       
 "وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ (46) الانفال",
 
            "وَأَنْ تَصْبِرُوا خَيْرٌ لَكُمْ وَاللَّهُ غَفُورٌ رَحِيمٌ (25) النساء",
            
"يَا أَيُّهَا النَّاسُ قَدْ جَاءتْكُم مَّوْعِظَةٌ مِّن رَّبِّكُمْ وَشِفَاء لِّمَا فِي الصُّدُورِ وَهُدًى وَرَحْمَةٌ لِّلْمُؤْمِنِينَ (57) يونس",

              "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ (153) البقرة",

              "قَالَ إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ (86) يوسف",

              "وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاء وَرَحْمَةٌ لِّلْمُؤْمِنِينَ وَلاَ يَزِيدُ الظَّالِمِينَ إَلاَّ خَسَارًا (82) الإسراء",

              "لَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِنْهُمْ وَلَا تَحْزَنْ عَلَيْهِمْ (88) الحجر",

              "فَمَنْ تَبِعَ هُدَايَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ (38) البقرة",

              "وَاصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا ۖ وَسَبِّحْ بِحَمْدِ رَبِّكَ حِينَ تَقُومُ (48) الطور",
              
"قال النبي ﷺ : ما أصاب أحداً هم ولا حزن فقال: اللهم إني عبدك وابن عبدك، وابن أمتك، ناصيتي بيدك، ماض في حكمك، عدل في قضاؤك، أسألك بكل اسم هو لك سميت به نفسك، أو علمته أحداً من خلقك، أو أنزلته في كتابك، أو استأثرت به في علم الغيب عندك، أن تجعل القرآن ربيع قلبي، ونور صدري، وجلاء حزني، وذهاب همي، إلا أذهب الله همه وحزنه، وأبدله مكانه فرحاً 🤲🏼 ",

"فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ (101) يوسف" ,

"رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي (16) القصص" ,
"دعاء سليمان عليه السلام : (رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ)",

"دعاء أيوب عليه السلام : (أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ)",

"رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ (19) النمل",

 "لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش الكريم، لا إله إلا الله رب السماوات والأرض ورب العرش العظيم",

"رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ (83) وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ (84) وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ (85) الشعراء",

"إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُم ۚ مَّا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا ۚ إِنَّ رَبِّي عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ (56) هود",

"وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ (155) الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُواْ إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ (156) أُوْلَئِكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ وَأُولَئِكَ هُمُ الْمُهْتَدُونَ (157) البقرة",
    
"اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجبن",

"اللهم إني ظلمت نفسي ظلماً كثيراً، ولا يغفر الذنوب إلا أنت، فاغفر لي مغفرة رحمة من عندك، وارحمني إنك أنت الغفور الرحيم",

"قال رسول الله ﷺ : ما يصيب المسلم من نصب ولا وصب ولا هم ولا حزن ولا أذى حتى الشوكة يشاكها إلا كان له بها أجر",


"قال رسول الله ﷺ : عجباً لأمر المؤمن! إن أمره كله له خير ـ وليس ذلك لأحد إلا المؤمن ـ إن أصابته سراء شكر فكان خيرا له، وإن أصابته ضراء صبر فكان خيرا له 🍃 ",
"لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا (40) التوبة",
"سبحان الله و بحمده ، سبحان الله العظيم",

    "سبحان الله ، و الحمدلله ، و لا إله إلا الله ، و الله أكبر ، اللهم اغفر لي ، اللهم ارحمني ، اللهم ارزقني",
    "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
    " لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات، ورب الأرض ورب العرش الكريم .. اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين وأصلح لي شأني كله ، لا إله إلا أنت سبحانك إني كنت من الظالمين .. الله الله ربي لا أشرك به شيئا",
    "اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن ، و غلبة الدين و قهر الرجال.",
    "اللهم اكفنى بحلالك عن حرامك وأغننى بفضلك عمن سواك",
    "إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي واخلف لي خيرا منها",
    "عن النبي ﷺ قال : سيد الاستغفار أن يقول العبد اللهم أنت ربي لا إله إلا أنت ، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت، أبوئ لك بنعمتك على وأبوئ بذنبي ، فاغفر لي فانه لا يغفر الذنوب إلا أنت ) من قالها في النهار موقناً بها فمات من يومه قبل أن يمسي فهو من أهل الجنة ومن قالها من الليل وهو موقناً بها فمات قبل أن يصبح فهو من أهل الجنة",
    "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    "حسبـيَ اللّهُ لا إله إلاّ هو علـيه توكَـلت وهو رب العرش العظـيم",
    "بسـمِ الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم",
    "سبحـانَ الله و بحمـده عدد خَلْـقِه ، و رِضـا نفسـه ، و زِنَـةَ عـرشـه ، ومـداد كلمـاتـه",
    "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت",
    "اللهم إني أعوذ بك من الكفر، والفقر، اللهم إني أعوذ بك من عذاب القبر لا إله إلا أنت",
    " يا حي يا قيوم ، برحمتك أستغيث ، أصلح لي شأني كله ، ولا تكلني إلى نفسي طرفة عين",
    "اللهم إني أسألك العفو والعافية في الدنيا والآخرة ، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهـلي ومالي، اللهم استـر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي، ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أغتال من تحتي.",
    "اللهم صل و سلم و بارك على نبينا محمد",
    /// for chatbot
    
"كن على طبيعتك .. لا تهتم لرأي الناس .. لقد خلقك الله على ما أنت عليه لحكمة ! ✨ ",
"عندما تتغير الحياة لتصبح أصعب .. غيّر نفسك لتصبح أقوى ! 💪🏼 ",
"أنصِت للصوت الذي يتردّد في أعماقك قائلاً أنك تستطيع أن تتجاوز الفشل و اتبعه",
    "لا تضيع وقتك بإقناع الآخرين بما تحاول تحقيقه .. يكفي فقط أنك مقتنع بقدرتك على تحقيقه",
    "عندما تعطيك الحياة مئة سبب كي تبكي و تنهار .. أظهر للحياة أنك تمتلك ألف سبب لتبتسم و تضحك .. ابقَ قوياً دائماً",
    "إن ما ينتظرك أجمل مما يحيط بك .. فلا نتظر للحياة نظرة واحدة .. فتفقد الأمل ! ",
    "إنك لا تخسر حقاُ إلا إذا توقفت عن المحاولة",
    "ليس كل كسر نهاية.. هناك كسر بداية ، يعلن الانطلاق و يعلن حياة جديدة ! 🌺 ",
    "الله معك في كل أمر .. في كل حادثة .. في كل عسر .. في كل وجع و ضعف .. لا ينشغل عنك أبداً",
    "ما يجعلك مختلفاً يجعلك جميلاً ✨ ",
 "إنّ الله يسمعك ، إن أثقلك الكتمان يوماً 💛",
 "العقبات هي الثمن الذي تدفعه للوصول إلى العظَمة",
 "نعم .. لا تستطيع العودة و تغيير البداية ، و لكن يمكنك البدء من مكانك الآن و تغيّر النهاية",
 "أنت لا تجد الحياة السعيدة .. بل أنت تصنعها",
 "أعرف أنها عملية بطيئة .. لكن الاستسلام لن يسرّعها",
 "أنت أقوى ممّا تعلم"
]
